# GetRenameOnSlowDoubleClickInProjectBrowser Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DoubleClickOptions..::..GetRenameOnSlowDoubleClickInProjectBrowser Method
DoubleClickOptions Class See Also
---
Returns the user's desire to rename item in project browser on slow double-click.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool GetRenameOnSlowDoubleClickInProjectBrowser()
```

Visual Basic
---
```text
Public Function GetRenameOnSlowDoubleClickInProjectBrowser As Boolean
```

Visual C++
---
```text
public:
bool GetRenameOnSlowDoubleClickInProjectBrowser()
```

# See Also
DoubleClickOptions Class
Autodesk.Revit.UI Namespace